DELETE FROM `creature_template` WHERE `entry` IN (200000,200001);
INSERT INTO `creature_template` VALUES (200000, 0, 0, 0, 0, 0, 5567, 5567, 5567, 5567, 'Ice guard', 'ZEONE ALLIANCE', '', 0, 83, 83, 0, 12, 12, 0, 1, 1.14286, 1, 1, 10000000, 10000000, 0, 9999999, 10000000, 1, 9999999, 0, 0, 0, 0, 0, 0, 0, 0, 10000000, 10000000, 65535, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 3, 900000, 900000, 1, 0, 0, 0, 0, 0, 0, 0, 0, 255, 0, 0, 0, '', 1);
INSERT INTO `creature_template` VALUES (200001, 0, 0, 0, 0, 0, 14732, 14732, 14732, 14732, 'Fire guard', 'ZEONE HORDE', '', 0, 83, 83, 0, 29, 29, 0, 1, 1.14286, 1, 1, 10000000, 10000000, 0, 9999999, 10000000, 1, 9999999, 0, 0, 0, 0, 0, 0, 0, 0, 10000000, 10000000, 65535, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 3, 900000, 900000, 1, 0, 0, 0, 0, 0, 0, 0, 0, 255, 0, 0, 0, '', 1);
DELETE FROM `locales_creature` WHERE `entry` IN (200000,200001)
INSERT INTO `locales_creature` VALUES 
('200000', '', '', '', '', '', '', '', 'Ледяной стражник', null, null, null, null, null, null, null, 'ZEONE АЛЬЯНС'),
('200001', '', '', '', '', '', '', '', 'Огненный стражник', null, null, null, null, null, null, null, 'ZEONE ОРДА');
UPDATE `creature_template` SET `health_mod`=800, `mana_mod`=800 WHERE `entry` IN (200000,200001);
-- Russian Mafia vendor
DELETE FROM `creature_template` WHERE `entry` IN (200050);
INSERT INTO `creature_template` VALUES (200050, 0, 0, 0, 0, 0, 18, 18, 18, 18, 'Nefarian', 'Russian Mafia', '', 0, 83, 83, 0, 12, 12, 4481, 1, 1.14286, 1, 0, 999999, 999999, 999999, 999999, 999999, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 999999, 999999, 999999, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '', 0, 3, 999999, 999999, 1, 0, 0, 0, 0, 0, 0, 0, 0, 999999, 0, -1, 0, '', 1);
UPDATE `creature_template` SET `health_mod`=800, `mana_mod`=800 WHERE `entry` IN (200050);
DELETE FROM `locales_creature` WHERE `entry` IN (200050);
INSERT INTO `locales_creature` VALUES 
('200050', '', '', '', '', '', '', '', 'Нифариан', null, null, null, null, null, null, null, 'Русская Мафия');
DELETE FROM `npc_vendor` WHERE `entry` IN (200050);
INSERT INTO `npc_vendor` VALUES 
('200050', '0', '44128', '0', '0', '0'),
('200050', '0', '64323', '0', '0', '0'),
('200050', '0', '38425', '0', '0', '0'),
('200050', '0', '42225', '0', '0', '0'),
('200050', '0', '43102', '0', '0', '0'),
('200050', '0', '43126', '0', '0', '0'),
('200050', '0', '43127', '0', '0', '0'),
('200050', '0', '34057', '0', '0', '0'),
('200050', '0', '22450', '0', '0', '0'),
('200050', '0', '34054', '0', '0', '0'),
('200050', '0', '22449', '0', '0', '0'),
('200050', '0', '34722', '0', '0', '0'),
('200050', '0', '38561', '0', '0', '0');
-- Other guild... 
